16-datalog.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 16 : Datalog - a precursor to Prolog</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Chapter 16 : Datalog - a precursor to Prolog"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-11 07:37:53 CST"/>
<meta name="author" content="michal"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Chapter 16 : Datalog - a precursor to Prolog</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 intro</a></li>
<li><a href="#sec-2">2 The Datalog language</a></li>
<li><a href="#sec-3">3 Designing the implementation</a>
<ul>
<li><a href="#sec-3-1">3.1 A regular grammar for Datalog</a></li>
<li><a href="#sec-3-2">3.2 Parsing</a></li>
<li><a href="#sec-3-3">3.3 The symbol tables</a></li>
<li><a href="#sec-3-4">3.4 Outline of the interpreter:</a></li>
<li><a href="#sec-3-5">3.5 Code generation: opcodes</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 Formal Parameters:</a></li>
<li><a href="#sec-3-5-2">3.5.2 Actual parameters:</a></li>
<li><a href="#sec-3-5-3">3.5.3 Code for a predicate:</a></li>
<li><a href="#sec-3-5-4">3.5.4 The interpreter</a>
<ul>
<li><a href="#sec-3-5-4-1">3.5.4.1 1. call</a></li>
<li><a href="#sec-3-5-4-2">3.5.4.2 2. return</a></li>
<li><a href="#sec-3-5-4-3">3.5.4.3 3. push</a></li>
<li><a href="#sec-3-5-4-4">3.5.4.4 4. match-name</a></li>
<li><a href="#sec-3-5-4-5">3.5.4.5 5. match-var&gt;</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 Code generation: addresses</a></li>
</ul>
</li>
<li><a href="#sec-4">4 The Program</a>
<ul>
<li><a href="#sec-4-1">4.1 datalog</a></li>
<li><a href="#sec-4-2">4.2 utilities</a></li>
<li><a href="#sec-4-3">4.3 interpreter</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 show</a></li>
<li><a href="#sec-4-3-2">4.3.2 solve</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4 main</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Exercises and reading</a>
<ul>
<li><a href="#sec-5-1">5.1 Manual:</a></li>
<li><a href="#sec-5-2">5.2 Tutorial:</a></li>
<li><a href="#sec-5-3">5.3 Recapitulation:</a></li>
<li><a href="#sec-5-4">5.4 Explicit disjunctions:</a></li>
<li><a href="#sec-5-5">5.5 Control of solutions:</a></li>
<li><a href="#sec-5-6">5.6 Non-identity:</a></li>
<li><a href="#sec-5-7">5.7 Sets of solutions:</a></li>
<li><a href="#sec-5-8">5.8 Negation:</a></li>
<li><a href="#sec-5-9">5.9 Cut:</a></li>
<li><a href="#sec-5-10">5.10 Informal input language:</a></li>
<li><a href="#sec-5-11">5.11 Reading:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <span class="target">intro</span></h2>
<div class="outline-text-2" id="text-1">


<p>
In Chapter 11 we considered very special kinds of grammars which generate one of two exceptional languages: the empty language containing no strings at all, or the language containing just one string, the null-string. Given a logical interpretation, this was Proplog, essentially the propositional part of Prolog. In this chapter the propositions of Proplog become predicates, they now take parameters which are either individual constants or individual variables. The resulting language is called Datalog, it is suitable for certain database applications.
</p>
</div>

</div>
