text/16-datalog.org
* The Datalog language

Except for the parameters, Datalog is just Proplog. One can enter facts and rules into the database, and one can put /questions/.

Facts are just atomic formulas, rules are atomic formulas followed by a condition --- one or more atomic formulas conjoined. Explicit disjunctions are not needed. A question consists of one or more atomic formulas conjoined.

Atomic formulas consist of a /predicate/, optionally followed by a parenthesised list of one or more parameters separated by commas.

Parameters are individual constants --- now called /names/, starting with a lowercase letter, or they are individual variables --- or just /variables/, starting with an uppercase letter. Names have their obvious meaning, whereas variables are either quantified --- in facts and rules, or they are to be bound in queries. In facts and rules a variable first occurring in the /head/, the first atomic formula, is implicitly universally quantified. In rules a variable first occurring in the /body/, the condition, is implicitly existentially quantified. In queries any variable is intended to be replaced by whatever names will make the formula provable from the facts and rules of the database.

The following is a single run of the program Datalog. Comments are enclosed in =/*= and =*/=.

A plus symbol =+= indicates that what follows is to be entered into the database, as facts or rules.
A minus symbol =-= indicates that what follows is a series of questions.

Responses by the system start with a dieresis = ...= and what comes then is an answer =yes= or =no=, possibly preceded by a sequence of numbered variable bindings.

#+begin_src

/* entering */
 +
/* some facts: */
male(grandpaSmith).  male(mrSmith).  male(peterSmith).
male(johnJones).  male(babyJones).
female(mrsSmith).  female(maryJones).  female(sallyWilkinson).
father(grandpaSmith,mrSmith).
husband_wife(mrSmith,mrsSmith).
father(mrSmith,peterSmith).  mother(mrsSmith,peterSmith).
father(mrSmith,maryJones).  mother(mrsSmith,maryJones).
husband_wife(johnJones,maryJones).
father(johnJones,babyJones).  mother(maryJones,babyJones).
loves(peterSmith,sallyWilkinson).

/* some rules: */
married(H,W) :- husband_wife(H,W).  married(W,H) :- husband_wife(H,W).
loves(X,Y) :- married(X,Y).
parent(X,Y) :- father(X,Y).  parent(X,Y) :- mother(X,Y).

/* some questions: */
 -
male(mrSmith).
... yes

male(mrsSmith).
... no

female(X).
1:
X  =  mrsSmith
2:
X  =  maryJones
3:
X  =  sallyWilkinson
... yes

loves(X,johnJones).
1:
X  =  maryJones
... yes

loves(X,Y).
1:
X  =  peterSmith
Y  =  sallyWilkinson
2:
X  =  mrSmith
Y  =  mrsSmith
3:
X  =  johnJones
Y  =  maryJones
4:
X  =  mrsSmith
Y  =  mrSmith
5:
X  =  maryJones
Y  =  johnJones
... yes

parent(PARENT,babyJones).
1:
PARENT  =  johnJones
2:
PARENT  =  maryJones
... yes

/* some consistency checks: */
father(F,C), female(F).
... no
mother(M,C), male(M).
... no
husband_wife(H,W), female(H).
... no
husband_wife(H,W), male(W).
... no

/* more rules: */
 +
ancestor(X,Y) :- parent(X,Y).
ancestor(X,Z) :- parent(X,Y), ancestor(Y,Z).

/* more questions: */
 -
ancestor(grandpaSmith,DESCENDENT).
1:
DESCENDENT  =  mrSmith
2:
DESCENDENT  =  peterSmith
3:
DESCENDENT  =  maryJones
4:
DESCENDENT  =  babyJones
... yes

ancestor(ANCESTOR,DESCENDANT).
1:
ANCESTOR  =  grandpaSmith
DESCENDANT  =  mrSmith
2:
ANCESTOR  =  mrSmith
DESCENDANT  =  peterSmith
3:
ANCESTOR  =  mrSmith
DESCENDANT  =  maryJones
4:
ANCESTOR  =  johnJones
DESCENDANT  =  babyJones
5:
ANCESTOR  =  mrsSmith
DESCENDANT  =  peterSmith
6:
ANCESTOR  =  mrsSmith
DESCENDANT  =  maryJones
7:
ANCESTOR  =  maryJones
DESCENDANT  =  babyJones
8:
ANCESTOR  =  grandpaSmith
DESCENDANT  =  peterSmith
9:
ANCESTOR  =  grandpaSmith
DESCENDANT  =  maryJones
10:
ANCESTOR  =  grandpaSmith
DESCENDANT  =  babyJones
11:
ANCESTOR  =  mrSmith
DESCENDANT  =  babyJones
12:
ANCESTOR  =  mrsSmith
DESCENDANT  =  babyJones
... yes

/* a compound question: */
male(X), ancestor(X,babyJones).
1:
X  =  grandpaSmith
2:
X  =  mrSmith
3:
X  =  johnJones
... yes

/* testing repeated formals */
 +
likes(X,X) :- male(X).

 -
likes(X,Y).
1:
X  =  grandpaSmith
Y  =  grandpaSmith
2:
X  =  mrSmith
Y  =  mrSmith
3:
X  =  peterSmith
Y  =  peterSmith
4:
X  =  johnJones
Y  =  johnJones
5:
X  =  babyJones
Y  =  babyJones
... yes


/* ZOOLOGICAL DATABASE */

/* Note that this database treats species of animals and also
their sizes, colours and so on as individuals. This ploy is
philosophically suspect, but computationally convenient.
*/

 +
size(mouse,tiny). size(frog,tiny).
size(rabbit,small). size(fox,small).
size(wolf,medium). size(goat,medium). size(pig,medium).
size(bear,big). size(horse,big). size(cow,big).
size(elephant,huge). size(giraffe,huge).
size(X,small) :- size(X,tiny).  size(X,big) :- size(X,huge).

colour(mouse,grey). colour(mouse,black). colour(mouse,white).
colour(frog,green). colour(rabbit,brown). colour(rabbit,white).
colour(fox,red). colour(wolf,brown). colour(elephant,grey).

feet(horse,hooves). feet(cow,hooves). feet(goat,hooves).
feet(rabbit,paws). feet(fox,paws). feet(bear,paws).

herbivore(rabbit). herbivore(elephant). herbivore(giraffe).
herbivore(X) :- feet(X,hooves).

carnivore(fox). carnivore(wolf). carnivore(bear).

bigger(X,Y) :- size(X,small), size(Y,tiny).
bigger(X,Y) :- size(X,medium), size(Y,small).
bigger(X,Y) :- size(X,big), size(Y,medium).
bigger(X,Y) :- size(X,huge), size(Y,big).

eats(X,grass) :- herbivore(X).  eats(X,leaves) :- herbivore(X).
eats(X,Y) :- carnivore(X), bigger(X,Y).

eaten(X) :- eats(Y,X).

 -
/* which animal eats another animal of the same colour? */
eats(EATER,EATEN), colour(EATER,COLOUR), colour(EATEN,COLOUR).
1:
    EATER  =  wolf
    EATEN  =  rabbit
    COLOUR  =  brown
 ... yes

/* which tiny animals are eaten? */
eaten(X), size(X,tiny).
1:
    X  =  mouse
2:
    X  =  frog
3:
    X  =  mouse
4:
    X  =  frog
 ... yes

herbivore(ANIMAL), size(ANIMAL,big), colour(ANIMAL, grey).
1:
    ANIMAL  =  elephant
 ... yes


/* A MINIATURE AIRLINE - THEY ONLY HAVE TWO FLIGHTS */

/* illustrating the reduction of n-ary to binary predicates */

 +
dep_place(f1,melbourne).        arr_place(f1,honolulu).
dep_day(f1,monday).             arr_day(f1,tuesday).
dep_time(f1,h20).               arr_time(f1,h08).

dep_place(f2,honolulu).         arr_place(f2,melbourne).
dep_day(f2,thursday).           arr_day(f2,friday).
dep_time(f2,h22).               arr_time(f2,h10).

flight(N,D_PLACE,D_DAY,D_TIME,A_PLACE,A_DAY,A_TIME) :-
        dep_place(N,D_PLACE),           arr_place(N,A_PLACE),
        dep_day(N,D_DAY),               arr_day(N,A_DAY),
        dep_time(N,D_TIME),             arr_time(N,A_TIME).

 -
/* what is the flight departing Honolulu and arriving in Melbourne? */

flight(FLIGHT_NUMBER,honolulu,DEPARTURE_DAY,DEPARTURE_TIME,
                     melbourne,ARRIVAL_DAY,ARRIVAL_TIME).
1:
    FLIGHT_NUMBER  =  f2
    DEPARTURE_DAY  =  thursday
    DEPARTURE_TIME  =  h22
    ARRIVAL_DAY  =  friday
    ARRIVAL_TIME  =  h10
 ... yes

/* which flight arrives on a tuesday ? */

flight(FLIGHT_NUMBER,DEPARTURE_PLACE,DEPARTURE_DAY,DEPARTURE_TIME,
                     ARRIVAL_PLACE,tuesday,ARRIVAL_TIME).
1:
    FLIGHT_NUMBER  =  f1
    DEPARTURE_PLACE  =  melbourne
    DEPARTURE_DAY  =  monday
    DEPARTURE_TIME  =  h20
    ARRIVAL_PLACE  =  honolulu
    ARRIVAL_TIME  =  h08
 ... yes

/* which flight arrives on a thursday ? */

flight(FLIGHT_NUMBER,DEPARTURE_PLACE,DEPARTURE_DAY,DEPARTURE_TIME,
                     ARRIVAL_PLACE,thursday,ARRIVAL_TIME).
 ... no
CPU time for this session: 150 milliseconds
#+end_src

The above sample run did not illustrate error treatment and did not show the generated code or any tracing during a run.

If you are familiar with Prolog, then you will notice that Datalog is pure Prolog but with terms restricted to being either simple variables or simple constants; there are no function symbols from which to build compound terms.

