text/16-datalog.org
* Designing the implementation

In order to obtain a short implementation, we shall spend some effort in designing the most suitable /grammar/ for Datalog. As in previous projects, the next design steps are the parser and then, in several steps, the translator and the interpreter.

** A regular grammar for Datalog

In previous chapters we have generally started by giving a ready made grammar and possibly a complete manual. Then it became possible to base the implementation on the grammar. In this chapter we shall develop the grammar in several stages.

#+begin_src
input  ::=
        [   '+'
          | '-'
          | atom { ':-' formula } '.'
          | formula '.' ]
formula  ::=  atom { ',' formula }
atom  ::=  predicate { '(' parameterlist ')' }
parameterlist  ::=  parameter { ',' parameterlist }
parameter  ::=  variable | name
predicate  ::=  l-identifier
name  ::=  l-identifier
variable  ::=  u-identifier
l-identifier  ::=  lowercase letter,
                   followed by further letters, digits and underscores
u-identifier  ::=  uppercase letter,
                   followed by further letters, digits and underscores
#+end_src

Note that formulas and parameterlists are very similar in structure, and that both are recursively defined in terms of themselves. There is no other recursion at all. If these two recursive definitions could be replaced by non-recursive ones, then the entire grammar would be free of recursion. Then any occurrences of non-terminals could be replaced by their definition, and the entire language would be defined by just the first production as expanded.

To remove the recursion in the definitions of formulas and parameterlists we can replace the option braces by repetition brackets:

#+begin_src
formula  ::=  atom [ ',' atom ]
parameterlist  ::=  parameter  [ ',' parameter ]
#+end_src

If in the production for formula we now replace the two occurrences of atom by its definition we end up with:

#+begin_src
formula  ::=  predicate { '(' parameterlist ') }
              [ ',' predicate { '(' parameterlist ')' } ]
#+end_src

If we replace the two occurrences of parameterlist by its definition, then we end up with something even longer. Clearly what is needed is a way of defining formulas as consisting of one or more atomic formulas separated by commas. A construct that does this is what is used by Digital Equipment Corporation in their help files.

The dieresis =...= is to mean: the previous item. Inside repetition brackets it means: while there is a comma, repeat the previous item. Note that the dieresis can always be eliminated by replacing it textually with the previous item. Hence no new expressive power is introduced by the device.

The two productions can now be written like this:

#+begin_src
formula  ::=  atom [',' ...]
parameterlist  ::=  parameter  [',' ...]
#+end_src

The device has the welcome effect that diereses are not non-terminals and hence are not to be expanded.

We can now expand:

#+begin_src
parameterlist  ::=  (name | variable) [',' ...]
atom  ::=  predicate { '(' (name | variable) [',' ...] ')' }
formula  ::=  ( predicate { '(' (name | variable) [',' ...] ')' } )
              [',' ...]
#+end_src

The entire grammar can now be written as:

#+begin_src
input  ::=
  [   '+'
    | '-'
    | { l-identifier { '(' (l-identifier | u-identifier) [',' ...] ')' } }
      { ':-' }
      { ( l-identifier { '(' (l-identifier | u-identifier) [',' ...] ')' } )
        [',' ...] }
      '.' ]
#+end_src

The first long line handles the /formal/ parameters, the second long line handles the /actual/ parameters. Having the lists of parameters defined twice seems wasteful, but it is a small price to pay for the elimination of other non-terminals. More importantly, having them defined twice is in fact helpful for the compiler, because code generation is very different for the formal and actual parameters.

The entire grammar is non-recursive --- in the right hand side of the production the only symbols are the terminals =+=, =-=, =(=, =)=, =,=, =:-=, =.= and the two non-terminals l-identifier and u-identifier. Even these two non-terminals could be eliminated in favour of terminals.

However, the terminals and these two non-terminals will of course be handled by the scanner, so there is no point in doing this elimination. There are no other non-terminals, apart from the start symbol, so the entire language is defined by the regular expression which is the right hand side of one production. Hence it will be possible to write a parser which does not use any parsing procedures apart from the main program.

This is the first time that we have had a non-trivial language which could be defined by a regular expression. We shall use the opportunity to write the entire parser in the main program. You should judge yourself whether you like this monolithic style or whether you prefer to have the parser broken up into several procedures.

