16-datalog.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Designing the implementation</h2>
<div class="outline-text-2" id="text-3">


<p>
In order to obtain a short implementation, we shall spend some effort in designing the most suitable <i>grammar</i> for Datalog. As in previous projects, the next design steps are the parser and then, in several steps, the translator and the interpreter.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> A regular grammar for Datalog</h3>
<div class="outline-text-3" id="text-3-1">


<p>
In previous chapters we have generally started by giving a ready made grammar and possibly a complete manual. Then it became possible to base the implementation on the grammar. In this chapter we shall develop the grammar in several stages.
</p>



<pre class="example">input  ::=
        [   '+'
          | '-'
          | atom { ':-' formula } '.'
          | formula '.' ]
formula  ::=  atom { ',' formula }
atom  ::=  predicate { '(' parameterlist ')' }
parameterlist  ::=  parameter { ',' parameterlist }
parameter  ::=  variable | name
predicate  ::=  l-identifier
name  ::=  l-identifier
variable  ::=  u-identifier
l-identifier  ::=  lowercase letter,
                   followed by further letters, digits and underscores
u-identifier  ::=  uppercase letter,
                   followed by further letters, digits and underscores
</pre>


<p>
Note that formulas and parameterlists are very similar in structure, and that both are recursively defined in terms of themselves. There is no other recursion at all. If these two recursive definitions could be replaced by non-recursive ones, then the entire grammar would be free of recursion. Then any occurrences of non-terminals could be replaced by their definition, and the entire language would be defined by just the first production as expanded.
</p>
<p>
To remove the recursion in the definitions of formulas and parameterlists we can replace the option braces by repetition brackets:
</p>



<pre class="example">formula  ::=  atom [ ',' atom ]
parameterlist  ::=  parameter  [ ',' parameter ]
</pre>


<p>
If in the production for formula we now replace the two occurrences of atom by its definition we end up with:
</p>



<pre class="example">formula  ::=  predicate { '(' parameterlist ') }
              [ ',' predicate { '(' parameterlist ')' } ]
</pre>


<p>
If we replace the two occurrences of parameterlist by its definition, then we end up with something even longer. Clearly what is needed is a way of defining formulas as consisting of one or more atomic formulas separated by commas. A construct that does this is what is used by Digital Equipment Corporation in their help files.
</p>
<p>
The dieresis <code>...</code> is to mean: the previous item. Inside repetition brackets it means: while there is a comma, repeat the previous item. Note that the dieresis can always be eliminated by replacing it textually with the previous item. Hence no new expressive power is introduced by the device.
</p>
<p>
The two productions can now be written like this:
</p>



<pre class="example">formula  ::=  atom [',' ...]
parameterlist  ::=  parameter  [',' ...]
</pre>


<p>
The device has the welcome effect that diereses are not non-terminals and hence are not to be expanded.
</p>
<p>
We can now expand:
</p>



<pre class="example">parameterlist  ::=  (name | variable) [',' ...]
atom  ::=  predicate { '(' (name | variable) [',' ...] ')' }
formula  ::=  ( predicate { '(' (name | variable) [',' ...] ')' } )
              [',' ...]
</pre>


<p>
The entire grammar can now be written as:
</p>



<pre class="example">input  ::=
  [   '+'
    | '-'
    | { l-identifier { '(' (l-identifier | u-identifier) [',' ...] ')' } }
      { ':-' }
      { ( l-identifier { '(' (l-identifier | u-identifier) [',' ...] ')' } )
        [',' ...] }
      '.' ]
</pre>


<p>
The first long line handles the <i>formal</i> parameters, the second long line handles the <i>actual</i> parameters. Having the lists of parameters defined twice seems wasteful, but it is a small price to pay for the elimination of other non-terminals. More importantly, having them defined twice is in fact helpful for the compiler, because code generation is very different for the formal and actual parameters.
</p>
<p>
The entire grammar is non-recursive &mdash; in the right hand side of the production the only symbols are the terminals <code>+</code>, <code>-</code>, <code>(</code>, <code>)</code>, =,=, <code>:-</code>, <code>.</code> and the two non-terminals l-identifier and u-identifier. Even these two non-terminals could be eliminated in favour of terminals.
</p>
<p>
However, the terminals and these two non-terminals will of course be handled by the scanner, so there is no point in doing this elimination. There are no other non-terminals, apart from the start symbol, so the entire language is defined by the regular expression which is the right hand side of one production. Hence it will be possible to write a parser which does not use any parsing procedures apart from the main program.
</p>
<p>
This is the first time that we have had a non-trivial language which could be defined by a regular expression. We shall use the opportunity to write the entire parser in the main program. You should judge yourself whether you like this monolithic style or whether you prefer to have the parser broken up into several procedures.
</p>
</div>

</div>
