text/16-datalog.org
** Parsing

The scanner has to recognise several single character symbols, the two character symbol turnstyle =:-=, and user introduced identifiers.  The latter may be predicates or names, both starting with a lowercase letter, or they may be variables, starting with an uppercase letter.  It is best if the scanner distinguishes identifiers beginning with a lowercase letter and those beginning with an uppercase letter.  It does not look up or enter into a symbol table.

The scanner also has to recognise Prolog- or C-style comments enclosed in =/*= and =*/=.  These are similar to the Pascal-style comments enclosed in =(*= and =*)= that were first used in Mondef.  The difference is that =(=, the first character of a Pascal-style comment, when not followed by a =*=, was also a legal character in Mondef, and, incidentally, in Pascal.  By contrast, the slash =/=, the first character of a Prolog- or C-style comment, when not followed by a =*=, is not a legal symbol in Datalog, though it is in Prolog and in C.

Since no parsing procedures are needed, the entire parser is contained in the body of the main program. It consists of a big =REPEAT= loop which examines the current input symbol. If it is one of the mode switches =+= or =-=, then the mode is set accordingly, for entering or for questioning. Otherwise, depending on the mode, either a fact or rule is to be entered, or a question is to be put.

In entering mode, a clause is expected. The first symbol has to be a lowercase identifier, a predicate, and this may be followed by a parenthesised list of parameters separated by commas. If a left parenthesis is seen, then the list of parameters is handled by a =REPEAT= loop which exits when the next symbol is not a comma. Each parameter has to be a lowercase identifier, a constant, or an uppercase identifier, a variable. The next symbol should then be a right parenthesis. After the predicate and perhaps the parameters, a turnstyle may occur; if not, a period is expected.

Whatever the mode, if the next symbol is not a period, a formula is expected, consisting of one or more atomic formulas separated by the /and/-commas. This is again handled by a =REPEAT= loop which on each pass handles one atomic formula, the loop exits when the next symbol is not an identifier. Each atomic formula is handled like the head of a clause described in the previous paragraph: it has to consist of a lowercase identifier possibly followed by a list of parameters handled by a further =REPEAT= loop.

Whatever the mode, the next symbol must be the terminating period.

This completes the parser. Note that the comma-separated lists of formal and actual parameters are treated slightly differently from the comma-separated lists of atomic formulas. Following the method of stepwise refinement used in previous chapters, we now expand on this basic skeleton. If you are writing the program yourself, you are strongly urged to write the parser up to this point.

** The symbol tables

During parsing two kinds of identifiers will be encountered by the scanner: those beginning with a lowercase letter and those beginning with an uppercase letter.

The parser accepts lowercase identifiers in predicate position to the left of the turnstyle and to the right of the turnstyle. Such predicates have to be recognised later, so they are entered into a table of predicates. That table will also contain pointers to the code of each defined predicate.

The parser accepts lowercase identifiers and uppercase identifiers in parameter positions, either as formal parameters to the left of the turnstyle, or as actual parameters to the right of the turnstyle.

Variables play a vital role for identification of values inside a clause or a query, but their meaning is local to that clause or query. Therefore they can be entered into a shortlived and quite small table as they are encountered; the same space can be used for all clauses and queries. On the other hand, lowercase identifiers in parameter positions are names, they retain their meaning outside any clause in which they occur, so they have to be entered into a permanent table.

It follows that there are three separate tables: for predicates, for variables and for names. They are not managed by the scanner but each by an independent function which handles lookup and, if necessary, new entries. All three tables will be consulted for code generation to determine various addresses.

There is one more major =ARRAY=, the code that is generated by the now familiar procedure generate.

If an error occurs, then all three tables should be restored to what they were at the start of the clause or query in which the error happened. In particular, any recent entries to any of the tables should be removed, by resetting the indices to what they were at the start of the clause or query containing the error. The resetting is done by the error procedure, but it has to know what to reset the indices to. So, the main program must set several save-variables
to the values of the variables to be saved. Setting these save-variables has to occur just before a clause or query is being read. Actually only the indices of the table of predicates and the table of names have to be reset by the error procedure, since the table of variables will be reset automatically for the reading of the next clause or query. And while on the topic of resetting, in order not to waste space in the code that has been generated, the index to the last code should be reset after any error or after reading and processing a query.

The utility routines then are:
 - a procedure =getch=,
 - a procedure =getsym=,
 - three functions for looking up the three tables,
 - a procedure for generating code,
 - and procedures for reporting normal syntactic errors and fatal errors when tables overflow.

The only other procedure is the interpreter, the theorem prover itself.

