16-datalog.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Parsing</h3>
<div class="outline-text-3" id="text-3-2">


<p>
The scanner has to recognise several single character symbols, the two character symbol turnstyle <code>:-</code>, and user introduced identifiers.  The latter may be predicates or names, both starting with a lowercase letter, or they may be variables, starting with an uppercase letter.  It is best if the scanner distinguishes identifiers beginning with a lowercase letter and those beginning with an uppercase letter.  It does not look up or enter into a symbol table.
</p>
<p>
The scanner also has to recognise Prolog- or C-style comments enclosed in <code>/*</code> and <code>*/</code>.  These are similar to the Pascal-style comments enclosed in <code>(*</code> and <code>*)</code> that were first used in Mondef.  The difference is that <code>(</code>, the first character of a Pascal-style comment, when not followed by a <code>*</code>, was also a legal character in Mondef, and, incidentally, in Pascal.  By contrast, the slash <code>/</code>, the first character of a Prolog- or C-style comment, when not followed by a <code>*</code>, is not a legal symbol in Datalog, though it is in Prolog and in C.
</p>
<p>
Since no parsing procedures are needed, the entire parser is contained in the body of the main program. It consists of a big <code>REPEAT</code> loop which examines the current input symbol. If it is one of the mode switches <code>+</code> or <code>-</code>, then the mode is set accordingly, for entering or for questioning. Otherwise, depending on the mode, either a fact or rule is to be entered, or a question is to be put.
</p>
<p>
In entering mode, a clause is expected. The first symbol has to be a lowercase identifier, a predicate, and this may be followed by a parenthesised list of parameters separated by commas. If a left parenthesis is seen, then the list of parameters is handled by a <code>REPEAT</code> loop which exits when the next symbol is not a comma. Each parameter has to be a lowercase identifier, a constant, or an uppercase identifier, a variable. The next symbol should then be a right parenthesis. After the predicate and perhaps the parameters, a turnstyle may occur; if not, a period is expected.
</p>
<p>
Whatever the mode, if the next symbol is not a period, a formula is expected, consisting of one or more atomic formulas separated by the <i>and</i>-commas. This is again handled by a <code>REPEAT</code> loop which on each pass handles one atomic formula, the loop exits when the next symbol is not an identifier. Each atomic formula is handled like the head of a clause described in the previous paragraph: it has to consist of a lowercase identifier possibly followed by a list of parameters handled by a further <code>REPEAT</code> loop.
</p>
<p>
Whatever the mode, the next symbol must be the terminating period.
</p>
<p>
This completes the parser. Note that the comma-separated lists of formal and actual parameters are treated slightly differently from the comma-separated lists of atomic formulas. Following the method of stepwise refinement used in previous chapters, we now expand on this basic skeleton. If you are writing the program yourself, you are strongly urged to write the parser up to this point.
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The symbol tables</h3>
<div class="outline-text-3" id="text-3-3">


<p>
During parsing two kinds of identifiers will be encountered by the scanner: those beginning with a lowercase letter and those beginning with an uppercase letter.
</p>
<p>
The parser accepts lowercase identifiers in predicate position to the left of the turnstyle and to the right of the turnstyle. Such predicates have to be recognised later, so they are entered into a table of predicates. That table will also contain pointers to the code of each defined predicate.
</p>
<p>
The parser accepts lowercase identifiers and uppercase identifiers in parameter positions, either as formal parameters to the left of the turnstyle, or as actual parameters to the right of the turnstyle.
</p>
<p>
Variables play a vital role for identification of values inside a clause or a query, but their meaning is local to that clause or query. Therefore they can be entered into a shortlived and quite small table as they are encountered; the same space can be used for all clauses and queries. On the other hand, lowercase identifiers in parameter positions are names, they retain their meaning outside any clause in which they occur, so they have to be entered into a permanent table.
</p>
<p>
It follows that there are three separate tables: for predicates, for variables and for names. They are not managed by the scanner but each by an independent function which handles lookup and, if necessary, new entries. All three tables will be consulted for code generation to determine various addresses.
</p>
<p>
There is one more major <code>ARRAY</code>, the code that is generated by the now familiar procedure generate.
</p>
<p>
If an error occurs, then all three tables should be restored to what they were at the start of the clause or query in which the error happened. In particular, any recent entries to any of the tables should be removed, by resetting the indices to what they were at the start of the clause or query containing the error. The resetting is done by the error procedure, but it has to know what to reset the indices to. So, the main program must set several save-variables
to the values of the variables to be saved. Setting these save-variables has to occur just before a clause or query is being read. Actually only the indices of the table of predicates and the table of names have to be reset by the error procedure, since the table of variables will be reset automatically for the reading of the next clause or query. And while on the topic of resetting, in order not to waste space in the code that has been generated, the index to the last code should be reset after any error or after reading and processing a query.
</p>
<p>
The utility routines then are:
</p><ul>
<li>a procedure <code>getch</code>,
</li>
<li>a procedure <code>getsym</code>,
</li>
<li>three functions for looking up the three tables,
</li>
<li>a procedure for generating code,
</li>
<li>and procedures for reporting normal syntactic errors and fatal errors when tables overflow.
</li>
</ul>


<p>
The only other procedure is the interpreter, the theorem prover itself.
</p>
</div>

</div>
