text/16-datalog.org
** Outline of the interpreter:

Several of our previous programs have used backtracking; they had a global variable to which changes were made and later undone. For Datalog the global variable will have to be a stack containing values of parameters of predicates being called. These parameters are either constants or variables. The latter may at any one moment be undefined or defined. When they become defined, they do not become constants, but they become pointers to constants or pointers to pointers to constants, or pointers to pointers to pointers to constants, and so on.

If two variables directly or indirectly point to a third which directly or indirectly points to a fourth, then if one of the first two becomes defined then so does the other and the third and the fourth. This is the way logical variables have to behave. In the stack any value that is a pointer value always points down into the lower part of the stack.

Now consider a query with several variables:

#+begin_src
p(X,Y), q(Y,Z).
#+end_src

The three variables =X=, =Y= and =Z= have to become variables at the bottom of the stack, so that their values may be printed out later.

For the call to =p=, =X= and =Y= have to be pushed as parameters --- the stack now contains five elements. Then =p= can be called, possibly repeatedly. Any one of these calls may give values to the parameters =X= and Y by giving values to the =X= and =Y= at the bottom of the stack.

Each of the calls that succeeds is followed by pushing =Y= and =Z= as parameters for =q= --- the stack now contains seven elements --- and possibly repeated calls to =q=. Each successful call to =q= is followed by the three bottom values =X=, =Y= and =Z= being printed. With this much by way of preview of the interpreter, we now take a first look at code generation.

** Code generation: opcodes

It will be best if we begin with the code generation for the formal and the actual parameters.

*** Formal Parameters:

Formal parameters occur in facts and in heads of rules. First, consider formal parameters that are names. At runtime a check has to be made that the corresponding actual parameters either matches or can be made to match this same name. The actual parameter can be a name or a variable pointing either directly or indirectly to something further down which is either defined or undefined. If the actual parameter is the same name as the formal parameters, or if the actual parameter is a direct or indirect pointer to the same name as the formal parameter, then the actual and the formal parameter already match. If the actual parameter is a different name or a pointer to a different name, then the parameters do not match and cannot be made to match. If the actual parameter is an undefined variable or a pointer to an undefined variable, then the actual and the formal parameter can be made to match by setting that undefined variable to the name which is the formal parameter. At compile time it will not be known in general which of these cases will occur at run time. But at compile time it is only necessary to generate a match instruction specifying which name is to be matched to which actual parameter. The name to be matched is passed as an address to the table of names. The actual parameter to be matched will be an address in the stack, but we leave the computation of that address to a further refinement step. So, when a formal parameter is a name, the compiler has to generate an instruction to match a name, and one field of the instruction, say the a-field, is the address of the name to be matched.

Second, consider formal parameters that are variables. The corresponding actual parameters can be a name or a variable. But if the formal parameter is a variable, this means that no restrictions are placed on the actual parameter. Hence no matching need be done, and no code has to be generated. There is one exception to this, when a formal parameter is a variable that has already occurred as an earlier formal parameter in the same fact or the same head of a rule. In that case the actual parameters corresponding to the first and later occurrences have to match or be made to match. This has two consequences for the compiler:

1) the first time that a variable occurs as a formal parameter no code is generated but it is recorded in the table of variables that it has already occurred.

2) any second or further time that variable occurs as a formal parameter an instruction has to be generated to match the later occurrences with the first occurrence. The computation of the two addresses to be matched is left to a further refinement step. So, when a formal parameter is a repeated variable, the compiler has to generate an instruction to match two actual parameters.

*** Actual parameters:

Actual parameters occur in bodies of rules and in queries. First, consider actual parameters that are names. At run time they may have to be matched with their corresponding formal parameters. For this to be possible, the actual parameters have to be on the stack at a position that will be known when the match is to be made. It is easiest to just push the actual parameter onto the stack, and to let the match instruction know where that will be. So when an actual parameter is a name, the compiler has to generate an instruction to push an address in the table of names onto the stack.

Second, consider actual parameters that are variables. Two cases need to be distinguished, depending whether we are in a query or in the body of a rule. In both cases a variable has to be pushed onto the stack. But the details will be different in queries and in bodies. In queries the address has to be an absolute address somewhere at the bottom of the stack, because this is where any real changes are to be made and where the values are located for printout. In bodies two subcases need to be distinguished: the actual parameter variable is a formal parameter of the head of the rule, or it is a variable which first occurred in the body. In the first subcase what has to be pushed at run time is a pointer to that formal parameter, so the compiler has to generate an instruction which will push an address to that formal parameter. But since the absolute address of that formal parameter cannot be known at compile time, it has to be a relative address, an offset from the current top of the stack. In the second subcase, when the actual parameter is a variable which first occurred in the body, this variable is to be understood as existentially quantified. There may be several occurrences of that same variable in the body. For the first occurrence a new location on the stack has to be claimed and set to undefined in the same way as the undefined values at the bottom of the stack in a query. Any later occurrences of the same variables have to become pointers to that first occurrence. So, for the first occurrence the compiler has to generate an instruction to push an undefined value. For the later occurrences it has to push the address of that value; this address will be relative to the top of the stack. Just as for repeated formal parameters, a record has to be kept in the table of variables when the instruction for the first occurrence was generated.

This completes the first step of the code generation for parameters; details of computing addresses are left as a further refinement step.

