16-datalog.html

<div id="outline-container-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Code for a predicate:</h4>
<div class="outline-text-4" id="text-3-5-3">


<p>
If a predicate is first used to the right of the turnstyle and never defined by a clause, then the table for predicates has to record this, so that the interpreter will fail and not continue with the solution set. If a predicate is being defined just once, then a pointer to the code for the clause has to be recorded in the table of predicates, to be found there by the interpreter. If a predicate is being defined a second time, then the table already contains a pointer to some code. Then this old code has to be disjoined with the new code, and the table has to be made to point to this new disjunction. If a predicate is being defined a third or further time, then the table already contains a pointer to a disjunction which has to be further disjoined with the new code so that the table can now point to the new disjunction. If this is done naively, then possibly inefficient code will result: the code for that predicate becomes a left linear tree and to access the code for the first clause the interpreter has to call itself recursively once for each clause that is does not yet want to execute. A right linear tree is preferable, it can be produced by remembering in the table the last disjunct and updating that for each new clause.
</p>
<p>
At first sight it looks as though for formulas much of the code generation and its later interpretation can be similar to the AND-OR trees we have seen before. In particular, conjunctions would become <i>and</i>-nodes, the implicit disjunctions of several clauses for the same predicate would become or-nodes, predicates in call-positions become <i>call</i>-nodes.
</p>
<p>
In addition, there will be various kinds of nodes for both formal and actual parameters. At first sight lists of formal or of actual parameters would be conjoined with <i>and</i>-nodes.
</p>
<p>
If parameters were to be linked by <i>and</i>-nodes, then for each parameter the interpreter has to execute two instructions, one for the parameter and one for the AND. There is a more efficient method which produces only half the code and hence is also faster to execute: It depends on the fact that each push or match is encoded in just one instruction. Parameters are pushed or matched in the order in which they occur in the source, and the execution can follow this order sequentially rather than relying on linkage. This implies when a push or a match has been done, the interpreter calls itself recursively with the textually next instruction.
</p>
<p>
The idea can be extended to the conjunctions arising from the comma separating atomic formulas. Again it is possible to let the interpreter handle each atomic formula and then the textually next atomic formula. A small price has to be paid for the elimination of <i>and</i>-nodes: now it becomes necessary to terminate the code for every formula by a special instruction whose execution causes the interpreter to continue with whatever caused the execution of the current formula.
</p>
</div>

</div>

<div id="outline-container-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> The interpreter</h4>
<div class="outline-text-4" id="text-3-5-4">


<p>
The principal component of the interpreter is a recursive procedure <i>solve</i> which takes two parameters: a (pointer to a) tree node and a continuation procedure. The nodes consist of an opcode and two integers which are addresses of other nodes, or of names in the table of names, or of predicates in the table of predicates, or of items in the run time stack. The main global data structure used by the interpreter is a stack whose items are either undefined, or the addresses of names, or of other items in the stack. To distinguish the two kinds of addresses, the former are stored as positive integers, the latter as negative integers; a zero value is undefined. In the main program, when a query has been read, the interpreter has to be initialised. For each of the variables that occurred in the query, the corresponding position in the runtime stack has to be initialised to undefined. Then the top of the stack has to be set to the number of such variables.
</p>
<p>
The interpreting procedure <code>solve</code> is called with two parameters: the first is the address of the first node of the query, and the second is a continuation procedure, the global procedure to display the contents of the stack corresponding to the variables of the query. When the call to procedure <code>solve</code> finally returns, either a yes or a no answer has to be given, depending on whether <code>solve</code> ever succeeded in calling its global continuation. Finally, to enable the space for the code of the query to be re-used, the index to the code should be reset to what it was before the query was read.
</p>
<p>
We now look in some detail at the five different instructions that have to be executed by the recursive interpreting procedure <code>solve</code>.
</p>

</div>
