text/16-datalog.org
**** 1. <<call>>
The /call/ instruction was generated by an atomic formula in either a query or in the body of a definition. The instruction contains an address into the table of predicates. At the time the instruction was generated, there may or may not have been any code associated with the predicate, and if not, some code may have become associated with it later. But at interpretation time whatever code is there has to be executed. So, if there is no code associated with the predicate, then nothing happens, the Datalog call to this predicate fails and the Pascal call to procedure =solve= merely returns. On the other hand, if there is some code associated with the predicate, then it will be in the form of a right linear tree of or-nodes, and the right-most or-node will not contain anything. It would be possible to interpret each or-node, but this would require two nodes to be interpreted for each clause of a predicate. However, the or-nodes are only generated for the disjunctions of formulas for each predicate. Hence it is possible to sidestep their execution entirely: the right linear tree of or-nodes is executed by a loop which simply executes each of the left parts of a tree.

This is done by initialising a local variable to the topmost or-node, and then using a =REPEAT= loop which calls the interpreter using the node address of the left part and then resets the local variable to the right. The loop terminates when the tree has been traversed and the variable points to nothing.

It is important that each of the later calls for the tree finds the interpreter in the same state as the first did. In particular, this means that the stack and the top of stack have to be the same for each of the calls. The stack itself will be changed and, on backtracking, restored by the other instructions; but the top of stack is best restored for each cycle of the loop. For each of the disjuncts of the left part of the tree, procedure =solve= calls itself recursively. The first parameter is of course the left part of the or-node currently in the loop, and the second parameter has to be a continuation procedure. As always, the continuation procedure will not be called directly, but only when the code for the current formula has been executed and its terminating return instruction is being executed. Now, executing the code for the current formula involves pushing and popping the stack and, importantly, assigning addresses of names to undefined values down in the stack. These assignments have to remain when the current call continues. But the top of the stack has to be restored before the next conjunct can be executed. Therefore the required continuation must be a local procedure which restores the top of stack to what it was when the current cycle of the loop was entered. So, before entering the =REPEAT= loop the top of stack can be saved in a local variable to be reset by the local procedure which then calls the continuation which is the parameter. Of course it is possible that this local procedure is not called at all, so the top of stack has to be reset to the local variable independently for each cycle of the =REPEAT= loop.

**** 2. <<return>>

The code for each formula is terminated by a /return/ instruction. Even the code for a clause without a body, i.e. a fact, is terminated by such an instruction. When the interpreter reaches the return instruction, it has to continue with the next conjunct of a formula, or with the next return or --- eventually --- with the global procedure to display the values in the lower parts of the stack. Whichever it is will have accumulated in the chain of continuation procedures. So, for the return instruction the interpreter just has to call the continuation parameter. (Note that this is the second place where the continuation parameters may be called --- the other was in the local continuation procedure which restores the stack after the call instruction.)

**** 3. <<push>>

The various =push= instructions arise from actual parameters in queries and in bodies of rules: items to be pushed are names, absolute addresses in the stack, new uninitialised values, and relative addresses in the stack. All four species can be handled by just one instruction. The top of the stack has to be incremented. Then a value has to be assigned to this new location on the stack. For the first three kinds of items it is the value of the a-field of the instruction that is assigned to the top of the stack. For the fourth kind a relative address is obtained by taking instead the difference between the a-field and the top of stack. Then procedure =solve= calls itself recursively, using as the first parameter the textually next instruction and as the second parameter its own continuation. When the call returns, the stack should be restored to what it was before the call. There are two aspects of this:

   1) The top of stack has been incremented and should be decremented again. This resetting is already done by the call instruction.

   2) The stack itself has been overwritten by the value that was pushed. In normal pop operations there is no need to restore to a stack a value that was overwritten by a previous push operation. However, the situation is more complicated here. When a call to a predicate is completed and its return is executed, there may be further clauses waiting as alternatives. These have to find the stack in the same state as the one that was executed and has now returned. So, before procedure =solve= overwrites the stack and then calls itself, it must save the top of stack and what is contained there in two local variables. Then, when the recursive call returns, the top item of the stack is restored to what it was before the recursive call. It is not necessary to decrement the top of stack, because this is handled by the call instruction.

