text/16-datalog.org
**** 4. <<match-name>>

The =match-name= instruction is generated for formal parameters that are names. The instruction contains an address in the name table and an offset from the current top of stack. The instruction should succeed and continue just in case the item in the stack pointed to directly or indirectly by the item at the offset either matches or can be made to match the name addressed in the instruction. To find the item in the stack that is supposed to match, a local variable is initialised to a location given by the top of stack and the offset in the b-field of the instruction. Then a loop is entered: if the item there is merely an address, a negative number, then the local variable is set to that address and so on, until what is found in the stack is not an address. So it must be either a positive number, which is now an address into the table of names, or it is zero. In the first case that address is compared with the address in the a-field of the instruction. If they are the same, then procedure =solve= calls itself recursively, using the textually next instruction as the first parameter and its own continuation parameter as the second. On the other hand, if what is found at the end of the chain is a zero value, then this counts as undefined. The situation is familiar from previous programs: The undefined value has to be set to the address in the a-field of the instruction, then =solve= calls itself recursively as before, then the value has to be set to undefined again. Finally, if what is found at the end of the chain is an address that is different from the a-field of the instruction, then the match fails: nothing is done, the call just returns. Note that the actual name, a string, is never manipulated as such.

**** 5. <<match-var>

The /match-var/ instruction is generated when a formal parameter is repeated. The function of the instruction is similar to the match-name instruction. The difference is that the match-name instruction contains the address of the name to be matched, whereas the match-var instruction does not. Instead it contains two addresses to be matched, it should succeed and continue just in case the two items in the stack pointed to directly or indirectly by the two addresses either match or can be made to match. To find the two items, two local variables are initialised to the two locations given by the top of the stack and the two address fields of the instruction. Two loops are entered to chain along items in the stack until neither is an address in the stack. So both are now positive or zero. If one of them is zero, i.e. undefined, then it is set to the other, then =solve= calls itself recursively with the textually next instruction, then it is set back to undefined. If none of them is undefined, then =solve= calls itself recursively just in case the two are defined the same, otherwise the match fails and the call just returns.

