16-datalog.html

<div id="outline-container-3-5-4-4" class="outline-5">
<h5 id="sec-3-5-4-4"><span class="section-number-5">3.5.4.4</span> 4. <span class="target">match-name</span></h5>
<div class="outline-text-5" id="text-3-5-4-4">


<p>
The <code>match-name</code> instruction is generated for formal parameters that are names. The instruction contains an address in the name table and an offset from the current top of stack. The instruction should succeed and continue just in case the item in the stack pointed to directly or indirectly by the item at the offset either matches or can be made to match the name addressed in the instruction. To find the item in the stack that is supposed to match, a local variable is initialised to a location given by the top of stack and the offset in the b-field of the instruction. Then a loop is entered: if the item there is merely an address, a negative number, then the local variable is set to that address and so on, until what is found in the stack is not an address. So it must be either a positive number, which is now an address into the table of names, or it is zero. In the first case that address is compared with the address in the a-field of the instruction. If they are the same, then procedure <code>solve</code> calls itself recursively, using the textually next instruction as the first parameter and its own continuation parameter as the second. On the other hand, if what is found at the end of the chain is a zero value, then this counts as undefined. The situation is familiar from previous programs: The undefined value has to be set to the address in the a-field of the instruction, then <code>solve</code> calls itself recursively as before, then the value has to be set to undefined again. Finally, if what is found at the end of the chain is an address that is different from the a-field of the instruction, then the match fails: nothing is done, the call just returns. Note that the actual name, a string, is never manipulated as such.
</p>
</div>

</div>
