16-datalog.html

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> <span class="target">utilities</span></h3>
<div class="outline-text-3" id="text-4-2">




<pre class="example">(* - - - - -   U T I L I T I E S   - - - - - *)

PROCEDURE getch;
BEGIN
IF eof THEN GOTO 99;
IF eoln THEN BEGIN readln; IF echo THEN writeln; ch := ' ' END
        ELSE BEGIN read(ch); IF echo THEN write(ch) END
END;

PROCEDURE point(mes : message);
BEGIN
write('error: seen "');
IF sym IN [l_ident,u_ident] THEN write(al) ELSE write(lastch);
writeln('" when ',mes);
END; (* point *)

PROCEDURE error(mes : message);
BEGIN
WHILE not eoln DO getch; readln; IF echo THEN writeln;
point(mes);
lastpredtab := save_lastpredtab; lastcode := save_lastcode;
lastnametab := save_lastnametab;
WHILE NOT eoln DO getch; readln; GOTO 1
END (* error *);

PROCEDURE fatal(mes : message);
BEGIN
IF echo THEN writeln;
write('fatal '); point(mes); GOTO 99
END; (* fatal *)

PROCEDURE getsym;
LABEL 1;
VAR k : integer;
BEGIN
1: WHILE ch &amp;lt;= ' ' DO getch;
IF ch IN ['A'..'Z','a'..'z'] THEN
    BEGIN (* identifier *)
    IF ch IN ['a'..'z'] THEN sym := l_ident ELSE sym := u_ident;
    k := 0; al := nullalfa;
    REPEAT
        IF k &lt; alfalength THEN
            BEGIN k := k + 1; al[k] := ch END;
        getch
        UNTIL NOT (ch IN ['A'..'Z','a'..'z','0'..'9','_'])
    END (* identifier *)
ELSE
    BEGIN
    lastch := ch; getch; sym := badchar; (* for errors *)
    CASE lastch OF
        '+' : sym := plus;
        '-' : sym := minus;
        '(' : sym := lpar;
        ')' : sym := rpar;
        ',' : sym := comma;
        '.' : sym := period;
        '?' : sym := query;
        ':' :
            BEGIN
            IF ch = '-' THEN getch ELSE
                error('":-" intended ?               ');
            sym := turnstyle
            END;
        '/' :
            BEGIN
            IF ch = '*' THEN getch ELSE
                error('"/*" intended ?               ');
            REPEAT
                WHILE ch &amp;lt;&gt; '*' DO getch;
                getch
                UNTIL ch = '/';
            getch; GOTO 1
            END;
        OTHERWISE
            error('this character is illegal     ');
        END (* CASE *)
    END (* ELSE *)
END;  (* getsym *)

FUNCTION predloc : integer;
VAR loc : integer;
BEGIN (* predloc *)
predtab[0].name := al; loc := lastpredtab;
WHILE predtab[loc].name &amp;lt;&gt; al DO loc := loc - 1;
IF loc = 0 THEN
    BEGIN
    IF lastpredtab = maxpreds THEN
        fatal('too many predicates in program');
    lastpredtab := lastpredtab + 1;
    WITH predtab[lastpredtab] DO
        BEGIN name := al; start := 0 END;
    loc := lastpredtab
    END;
predloc := loc
END; (* predloc *)

FUNCTION varloc : integer;
VAR loc : integer;
BEGIN (* varloc *)
vartab[0].name := al; loc := lastvartab;
WHILE vartab[loc].name &amp;lt;&gt; al DO loc := loc - 1;
IF loc = 0 THEN
    BEGIN
    IF lastvartab = maxvars THEN
        fatal('too many variables in program ');
    lastvartab := lastvartab + 1;
    WITH vartab[lastvartab]DO
        BEGIN name := al; adr := 0 END;
    loc := lastvartab
    END;
varloc := loc
END; (* varloc *)

FUNCTION nameloc : integer;
VAR loc : integer;
BEGIN (* nameloc *)
nametab[0] := al; loc := lastnametab;
WHILE nametab[loc] &amp;lt;&gt; al DO loc := loc - 1;
IF loc = 0 THEN
    BEGIN
    IF lastnametab = maxnames THEN
        fatal('too many names in program     ');
    lastnametab := lastnametab + 1;
    nametab[lastnametab] := al;
    loc := lastnametab
    END;
nameloc := loc
END; (* nameloc *)

PROCEDURE generate(o : operator; x,y : integer);
BEGIN (* generate *)
IF lastcode = maxcode THEN
        fatal('program is too big            ');
lastcode := lastcode + 1;
WITH code[lastcode] DO
    BEGIN op := o; a := x; b := y END
END; (* generate *)
</pre>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> <span class="target">interpreter</span></h3>
<div class="outline-text-3" id="text-4-3">


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> <span class="target">show</span></h4>
<div class="outline-text-4" id="text-4-3-1">




<pre class="example">(* - - - - -   I N T E R P R E T E R    - - - - - *)
PROCEDURE show;
VAR i,j : integer;
BEGIN (* show *)
num_successes := num_successes + 1;
IF lastvartab &gt; 0 THEN
    BEGIN
    writeln(num_successes:0,':');
    FOR i := 1 TO lastvartab DO
        BEGIN
        write('    ',vartab[i].name,'  =  ');
        j := runstack[i];
        IF debugging THEN IF tracing THEN
            write('[',j:0,']  ');
        WHILE j &lt; 0 DO j := runstack[-j];
        IF j &gt; 0 THEN write(nametab[j]);
        writeln
        END
    END
END; (* show *)
</pre>


</div>

</div>

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> <span class="target">solve</span></h4>
<div class="outline-text-4" id="text-4-3-2">




<pre class="example">PROCEDURE solve(t : integer; PROCEDURE cp);
VAR i,j : integer;

    PROCEDURE solvenext;
    BEGIN top := i; solve(t+1,cp) END;

BEGIN (* solve *)
WITH code[t] DO
    BEGIN
    IF tracing THEN
        BEGIN
        write('[',top:3,' : ');
        IF top &gt; 0 THEN write(runstack[top]:5)
                   ELSE write(' ':5);
        writeln(']      ',t,op,a,b)
        END;
    CASE op OF
        cal_ :
            WITH predtab[a] DO
                IF start &gt; 0 THEN
                    BEGIN
                    j := start; i := top;
                    REPEAT
                        IF debugging THEN IF tracing THEN
                            writeln('from node ',t:0,' call to "',
                                name,'" top = ',top:0);
                        solve(code[j].a,solvenext);
                        top := i; j := code[j].b;
                        UNTIL j = 0
                    END;
        return_ :
            cp;
        push :
            BEGIN
            IF top = maxstack THEN
                BEGIN writeln('stack overflow'); GOTO 99 END;
            top := top + 1;
            i := top; j := runstack[top]; (* save these *)
            runstack[top] := a - b * top;
            solve(t+1,cp);
            IF debugging THEN IF tracing THEN
                writeln('restoring stack[',i:0,'] to ',j:0);
            runstack[i] := j (* restore *)
            END;
        match_const :
            BEGIN
            i := top - b;
            WHILE runstack[i] &lt; 0 DO i := -  runstack[i];
            IF debugging THEN IF tracing THEN
                 writeln('matching at i = ',i:0,
                         ' where = ',runstack[i]:0);
            IF runstack[i] = a THEN solve(t+1,cp)
            ELSE IF runstack[i] = 0 THEN
                BEGIN
                runstack[i] := a;
                solve(t+1,cp);
                IF debugging THEN IF tracing THEN
                    writeln('setting stack[',i:0,'] from ',
                        runstack[i]:0,' to undefined');
                runstack[i] := 0
                END
            END;
        match_var :
            BEGIN
            i := top - a;
            WHILE runstack[i] &lt; 0 DO i := - runstack[i];
            j := top - b;
            WHILE runstack[j] &lt; 0 DO j := - runstack[j];
            IF runstack[i] = 0 THEN
                BEGIN
                runstack[i] := -j; solve(t+1,cp); runstack[i] := 0
                END
              ELSE IF runstack[j] = 0 THEN
                BEGIN
                runstack[j] := -i; solve(t+1,cp); runstack[j] := 0
                END
              ELSE IF runstack[i] = runstack[j] THEN solve(t+1,cp)
            END
        END (* CASE *)
    END (* WITH *)
END; (* solve *)
</pre>

</div>
</div>

</div>
