16-datalog.html

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <span class="target">main</span></h3>
<div class="outline-text-3" id="text-4-4">




<pre class="example">(* - - - - -   M A I N   - - - - - *)

BEGIN (* main *)
FOR i := 1 TO alfalength DO nullalfa[i] := chr(0);
lastcode := 0; lastpredtab := 0;lastnametab := 0;
ch := ' '; mode := entering;
1: REPEAT
    getsym;
    IF sym = plus THEN mode := entering
    ELSE IF sym = minus THEN mode := questioning
    ELSE
        BEGIN (* enter facts or rules, or question *)
        IF sym &amp;lt;&gt; query THEN tracing := false ELSE
            BEGIN tracing := true; getsym END;
        save_lastpredtab := lastpredtab; save_lastcode := lastcode;
        save_lastnametab := lastnametab;
        lastvartab := 0;

        IF mode = entering THEN
            BEGIN (* fact or head of rule *)
            IF sym &amp;lt;&gt; l_ident THEN
                error('predicate expected            ');
            WITH predtab[predloc] DO
                BEGIN
                generate(or_,lastcode+2,0);
                IF start = 0
                    THEN start := lastcode
                    ELSE code[finish].b := lastcode;
                finish := lastcode
                END;
            getsym; num_formals := 0;
            IF sym = lpar THEN
                BEGIN (* formal parameters *)
                REPEAT
                    num_formals := num_formals + 1; getsym;
                    IF sym = l_ident THEN (* name *)
                        generate(match_const,nameloc,num_formals)
                    ELSE IF sym = u_ident THEN
                        BEGIN (* variable *)
                        vloc := varloc;
                        WITH vartab[vloc] DO
                            IF adr = 0 THEN adr := num_formals ELSE
                                generate(match_var,adr,num_formals)
                        END (* variable *)
                    ELSE
                        error('name or variable expected     ');
                    getsym
                    UNTIL sym &amp;lt;&gt; comma;
                IF sym = rpar THEN getsym ELSE
                    error('"," or ")" expected           ');
                FOR i  := save_lastcode + 2 TO lastcode DO
                    WITH code[i] DO
                        BEGIN
                        b := num_formals - b;
                        IF op = match_var THEN a := num_formals - a
                        END
                END; (* formal parameters *)
            IF sym &amp;lt;&gt; period THEN (* rule *)
                IF sym = turnstyle THEN getsym ELSE
                    error('":-" or "." expected          ')
            END; (* fact or head of rule *)

        IF sym &amp;lt;&gt; period THEN
            BEGIN (* formula, for body or query *)
            num_actuals := 0;
            REPEAT
                IF sym &amp;lt;&gt; l_ident THEN
                    error('predicate expected            ');
                ploc := predloc; getsym;
                IF sym = lpar THEN
                    BEGIN (* actual parameters *)
                    REPEAT
                        num_actuals := num_actuals + 1; getsym;
                        IF sym = l_ident THEN
                            generate(push,nameloc,0)
                        ELSE IF sym = u_ident THEN
                            BEGIN (* variable *)
                            vloc := varloc;
                            IF mode = questioning THEN
                                generate(push,-vloc,0)
                            ELSE IF vloc &amp;lt;= num_formals THEN
                                generate(push,
                                 num_actuals + num_formals - vloc,1)
                            ELSE WITH vartab[vloc] DO
                                IF adr = 0 THEN
                                    BEGIN
                                    generate(push,0,0);
                                    adr := num_actuals
                                    END
                                  ELSE
                                    generate(push,
                                        num_actuals - adr,1)
                            END (* variable *)
                        ELSE error('name or variable expected     ');
                        getsym
                        UNTIL sym &amp;lt;&gt; comma;
                    IF sym = rpar THEN getsym ELSE
                        error('"," or ")" expected           ')
                    END; (* actual parameters *)
                IF NOT (sym IN [comma,period]) THEN
                    error('"," or "." expected           ');
                generate(cal_,ploc,0);
                IF sym = comma THEN getsym
                UNTIL NOT (sym IN [l_ident,u_ident])
            END; (* formula, for body or query *)

        IF sym &amp;lt;&gt; period THEN
            error('"." expected                  ');
        generate(return_,0,0);
        IF tracing THEN
            FOR i := save_lastcode + 1 TO lastcode DO
                WITH code[i] DO writeln(i:3,'  ',op,a,b);

        IF mode = questioning THEN
            BEGIN
            FOR i := 1 TO lastvartab DO runstack[i] := 0;
            top := lastvartab; num_successes := 0;
            solve(save_lastcode + 1,show);
            IF num_successes &gt; 0
                THEN writeln(' ... yes')
                ELSE writeln(' ... no');
            lastcode := save_lastcode
            END

        END (* ELSE, enter facts or rules, or question *)
    UNTIL false;
99: writeln('CPU time for this session: ',clock:0,' milliseconds')
END.
</pre>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Exercises and reading</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Manual:</h3>
<div class="outline-text-3" id="text-5-1">


<p>
Write a manual for Datalog. You may assume that your reader is familiar with some version of Prolog or with some other form of logic programming language. But you should not make any too specific assumptions. You may also assume that your reader is familiar with the syntax of some form of predicate logic. However, you should be aware that understanding the semantics of predicate logic is of no help in understanding the semantics of Datalog (or of Prolog).
</p>
</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Tutorial:</h3>
<div class="outline-text-3" id="text-5-2">


<p>
Write a tutorial for Datalog. You should assume that your reader does not know about Prolog and does not know about predicate logic. Readers who have studied your tutorial should then be able to understand your manual.
</p>
</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Recapitulation:</h3>
<div class="outline-text-3" id="text-5-3">


<p>
Why wasn't sequential execution used in the program for expanding regular expressions in Chapter~9, or in the program for semantic tableaux in Chapter~10, or the program for context free grammars in Chapter~11 or the program for monadic logic in Chapter~15?
</p>
</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Explicit disjunctions:</h3>
<div class="outline-text-3" id="text-5-4">


<p>
In Datalog all disjunctions are implicit, by way of multiple definitions of predicates. For any disjunctive query it is necessary to first give a multiple definition of some suitable and possibly contrived predicate, and this can be annoying. Implement explicit disjunctions for queries, and with no extra effort, for bodies of clauses. As usual, conjunctions should have greater precedence than disjunctions; so you should also allow parentheses for overriding precedences. Most of the parser will have to be rewritten completely, because the grammar will now be recursive.
</p>
</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Control of solutions:</h3>
<div class="outline-text-3" id="text-5-5">


<p>
As implemented, Datalog will spew forth all solutions it can find. Implementations of Prolog stop after each group of solutions and then let the user indicate whether more are wanted. Implement such a feature in Datalog.
</p>
</div>

</div>
