text/16-datalog.org
** Non-identity:

In Datalog and in Prolog there is no need for an identity relation. Different names always denote different individuals anyhow, so an identity statement using different names will always be false. Identity statements using a name and a variable are not needed because one can use the name instead of the variable throughout the clause or query. Identity statements using two different variables are not needed because one can use the same variable throughout the clause or query.

On the other hand, it is sometimes useful to have negated identity statements, or non-identity statements, but only if one of the two terms used is a variable. For example, one might want to define =X= and =Y= to be full siblings if they have two parents =P1= and =P2= in common. It is essential that =P1= and =P2= are not identical. Using, say =#= as the symbol for non-identity, the new atomic formula =P1 # P2= would be part of the definition for full siblinghood:

#+begin_src prolog
full_siblings(X,Y)  :-
    parent(P1,X), parent(P1,Y), parent(P2,X), parent(P2,Y), P1 # P2.
#+end_src

(One might argue that another condition is needed: =X # Y=.) Implement non-identity in Datalog. Beware of some difficulties: how would you handle the case where the non-identity statement is not the last conjunct in the definition, but the third, or the second, or even the first?

** Sets of solutions:

Prolog and Datalog will produce the same solution of variable bindings several times if there are several ways of proving them. For some applications this is exactly what is wanted, for some it is at least acceptable, but for others it is positively annoying. Modify the program so that each solution is printed only once. A similar exercise was already suggested for semantic tableaux in Chapter~10. When a solution is found, it will be necessary to check whether the same solution has been found before --- if not it has to be added. The solutions can be printed as soon as they have been found and been seen to be new, or they can be printed at the end when the entire set of solutions has been completed. Duplicate solutions are eliminated in the Logical Data Language LDL described in Naqvi and Tsur (1989).

** Negation:

Implement either a Prolog-like form of negation or a full classical negation. For the latter, a negated atom =not p(X)= with a variable as the actual parameter should return all those bindings of =X= for which the un-negated atom fails. The bindings are obtained by searching the table of names of individuals, hence it is assumed that there are no individuals other than those mentioned in one way or another. Note that such a classical form of negation only makes sense in Datalog, though not in full Prolog.

** Cut:

Study the cut primitive of Prolog and implement it in Datalog.

** Informal input language:

Design a different syntax for Datalog, closer to natural language, somewhat along the lines of Mondef in Chapter~15. A new syntax for facts and rules and questions should be designed. Then rewrite Datalog for this new syntax.

** Reading:

- Maier and Warren (1988) describe a sequence of implementations of Proplog, Datalog and Prolog.

- Kluzniak and Szpakiwics (1985) is said to contain a diskette with the Pascal source of a simple Prolog system.

- Campbell (1984) contains many articles on the implementation of full Prolog.

- Spivey (1996) contains an introduction to Prolog and the design and final source code for a Prolog implementation in Pascal.
