16-datalog.html

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> Non-identity:</h3>
<div class="outline-text-3" id="text-5-6">


<p>
In Datalog and in Prolog there is no need for an identity relation. Different names always denote different individuals anyhow, so an identity statement using different names will always be false. Identity statements using a name and a variable are not needed because one can use the name instead of the variable throughout the clause or query. Identity statements using two different variables are not needed because one can use the same variable throughout the clause or query.
</p>
<p>
On the other hand, it is sometimes useful to have negated identity statements, or non-identity statements, but only if one of the two terms used is a variable. For example, one might want to define <code>X</code> and <code>Y</code> to be full siblings if they have two parents <code>P1</code> and <code>P2</code> in common. It is essential that <code>P1</code> and <code>P2</code> are not identical. Using, say <code>#</code> as the symbol for non-identity, the new atomic formula <code>P1 # P2</code> would be part of the definition for full siblinghood:
</p>



<pre class="example">full_siblings(X,Y)  :-
    parent(P1,X), parent(P1,Y), parent(P2,X), parent(P2,Y), P1 # P2.
</pre>


<p>
(One might argue that another condition is needed: <code>X # Y</code>.) Implement non-identity in Datalog. Beware of some difficulties: how would you handle the case where the non-identity statement is not the last conjunct in the definition, but the third, or the second, or even the first?
</p>
</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> Sets of solutions:</h3>
<div class="outline-text-3" id="text-5-7">


<p>
Prolog and Datalog will produce the same solution of variable bindings several times if there are several ways of proving them. For some applications this is exactly what is wanted, for some it is at least acceptable, but for others it is positively annoying. Modify the program so that each solution is printed only once. A similar exercise was already suggested for semantic tableaux in Chapter~10. When a solution is found, it will be necessary to check whether the same solution has been found before &mdash; if not it has to be added. The solutions can be printed as soon as they have been found and been seen to be new, or they can be printed at the end when the entire set of solutions has been completed. Duplicate solutions are eliminated in the Logical Data Language LDL described in Naqvi and Tsur (1989).
</p>
</div>

</div>

<div id="outline-container-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> Negation:</h3>
<div class="outline-text-3" id="text-5-8">


<p>
Implement either a Prolog-like form of negation or a full classical negation. For the latter, a negated atom <code>not p(X)</code> with a variable as the actual parameter should return all those bindings of <code>X</code> for which the un-negated atom fails. The bindings are obtained by searching the table of names of individuals, hence it is assumed that there are no individuals other than those mentioned in one way or another. Note that such a classical form of negation only makes sense in Datalog, though not in full Prolog.
</p>
</div>

</div>

<div id="outline-container-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> Cut:</h3>
<div class="outline-text-3" id="text-5-9">


<p>
Study the cut primitive of Prolog and implement it in Datalog.
</p>
</div>

</div>

<div id="outline-container-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> Informal input language:</h3>
<div class="outline-text-3" id="text-5-10">


<p>
Design a different syntax for Datalog, closer to natural language, somewhat along the lines of Mondef in Chapter~15. A new syntax for facts and rules and questions should be designed. Then rewrite Datalog for this new syntax.
</p>
</div>

</div>

<div id="outline-container-5-11" class="outline-3">
<h3 id="sec-5-11"><span class="section-number-3">5.11</span> Reading:</h3>
<div class="outline-text-3" id="text-5-11">


<ul>
<li>Maier and Warren (1988) describe a sequence of implementations of Proplog, Datalog and Prolog.

</li>
<li>Kluzniak and Szpakiwics (1985) is said to contain a diskette with the Pascal source of a simple Prolog system.

</li>
<li>Campbell (1984) contains many articles on the implementation of full Prolog.

</li>
<li>Spivey (1996) contains an introduction to Prolog and the design and final source code for a Prolog implementation in Pascal.
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-01-11 07:37:53 CST</p>
<p class="author">Author: michal</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
